---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.WallFailures.CurtainOrStackedWallDisallowedForCrossSectionType
source: html/04d9f402-50c0-791a-ed90-a726779cc8db.htm
---
# Autodesk.Revit.DB.BuiltInFailures.WallFailures.CurtainOrStackedWallDisallowedForCrossSectionType Property

Curtain wall types and Stacked wall types are not allowed for this wall's cross-section type.

## Syntax (C#)
```csharp
public static FailureDefinitionId CurtainOrStackedWallDisallowedForCrossSectionType { get; }
```